ravynsoft/ravynos/gnu/usr.bin/binutils/gas/config/rl78-parse.c
};
typedef union YYSTYPE YYSTYPE;
# define YYSTYPE_IS_TRIVIAL 1
# define YYSTYPE_IS_DECLARED 1
#endif


extern YYSTYPE rl78_lval;


int rl78_parse (void);


#endif /* !YY_RL78_CONFIG_RL_PARSE_H_INCLUDED  */
/* Symbol kind.  */
enum yysymbol_kind_t
{
  YYSYMBOL_YYEMPTY = -2,
  YYSYMBOL_YYEOF = 0,                      /* "end of file"  */
  YYSYMBOL_YYerror = 1,                    /* error  */
  YYSYMBOL_YYUNDEF = 2,                    /* "invalid token"  */
  YYSYMBOL_A = 3,                          /* A  */
  YYSYMBOL_X = 4,                          /* X  */
  YYSYMBOL_B = 5,                          /* B  */
  YYSYMBOL_C = 6,                          /* C  */
  YYSYMBOL_D = 7,                          /* D  */
  YYSYMBOL_E = 8,                          /* E  */
  YYSYMBOL_H = 9,                          /* H  */
  YYSYMBOL_L = 10,                         /* L  */
  YYSYMBOL_AX = 11,                        /* AX  */
  YYSYMBOL_BC = 12,                        /* BC  */
  YYSYMBOL_DE = 13,                        /* DE  */
  YYSYMBOL_HL = 14,                        /* HL  */
  YYSYMBOL_SPL = 15,                       /* SPL  */
  YYSYMBOL_SPH = 16,                       /* SPH  */
  YYSYMBOL_PSW = 17,                       /* PSW  */
  YYSYMBOL_CS = 18,                        /* CS  */
  YYSYMBOL_ES = 19,                        /* ES  */
  YYSYMBOL_PMC = 20,                       /* PMC  */
  YYSYMBOL_MEM = 21,                       /* MEM  */
  YYSYMBOL_FLAG = 22,                      /* FLAG  */
  YYSYMBOL_SP = 23,                        /* SP  */
  YYSYMBOL_CY = 24,                        /* CY  */
  YYSYMBOL_RB0 = 25,                       /* RB0  */
  YYSYMBOL_RB1 = 26,                       /* RB1  */
  YYSYMBOL_RB2 = 27,                       /* RB2  */
  YYSYMBOL_RB3 = 28,                       /* RB3  */
  YYSYMBOL_EXPR = 29,                      /* EXPR  */
  YYSYMBOL_UNKNOWN_OPCODE = 30,            /* UNKNOWN_OPCODE  */
  YYSYMBOL_IS_OPCODE = 31,                 /* IS_OPCODE  */
  YYSYMBOL_DOT_S = 32,                     /* DOT_S  */
  YYSYMBOL_DOT_B = 33,                     /* DOT_B  */
  YYSYMBOL_DOT_W = 34,                     /* DOT_W  */
  YYSYMBOL_DOT_L = 35,                     /* DOT_L  */
  YYSYMBOL_DOT_A = 36,                     /* DOT_A  */
  YYSYMBOL_DOT_UB = 37,                    /* DOT_UB  */
  YYSYMBOL_DOT_UW = 38,                    /* DOT_UW  */
  YYSYMBOL_ADD = 39,                       /* ADD  */
  YYSYMBOL_ADDC = 40,                      /* ADDC  */
  YYSYMBOL_ADDW = 41,                      /* ADDW  */
  YYSYMBOL_AND_ = 42,                      /* AND_  */
  YYSYMBOL_AND1 = 43,                      /* AND1  */
  YYSYMBOL_BF = 44,                        /* BF  */
  YYSYMBOL_BH = 45,                        /* BH  */
  YYSYMBOL_BNC = 46,                       /* BNC  */
  YYSYMBOL_BNH = 47,                       /* BNH  */
  YYSYMBOL_BNZ = 48,                       /* BNZ  */
  YYSYMBOL_BR = 49,                        /* BR  */
  YYSYMBOL_BRK = 50,                       /* BRK  */
  YYSYMBOL_BRK1 = 51,                      /* BRK1  */
  YYSYMBOL_BT = 52,                        /* BT  */
  YYSYMBOL_BTCLR = 53,                     /* BTCLR  */
  YYSYMBOL_BZ = 54,                        /* BZ  */
  YYSYMBOL_CALL = 55,                      /* CALL  */
  YYSYMBOL_CALLT = 56,                     /* CALLT  */
  YYSYMBOL_CLR1 = 57,                      /* CLR1  */
  YYSYMBOL_CLRB = 58,                      /* CLRB  */
  YYSYMBOL_CLRW = 59,                      /* CLRW  */
  YYSYMBOL_CMP = 60,                       /* CMP  */
  YYSYMBOL_CMP0 = 61,                      /* CMP0  */
  YYSYMBOL_CMPS = 62,                      /* CMPS  */
  YYSYMBOL_CMPW = 63,                      /* CMPW  */
  YYSYMBOL_DEC = 64,                       /* DEC  */
  YYSYMBOL_DECW = 65,                      /* DECW  */
  YYSYMBOL_DI = 66,                        /* DI  */
  YYSYMBOL_DIVHU = 67,                     /* DIVHU  */
  YYSYMBOL_DIVWU = 68,                     /* DIVWU  */
  YYSYMBOL_EI = 69,                        /* EI  */
  YYSYMBOL_HALT = 70,                      /* HALT  */
  YYSYMBOL_INC = 71,                       /* INC  */
  YYSYMBOL_INCW = 72,                      /* INCW  */
  YYSYMBOL_MACH = 73,                      /* MACH  */
  YYSYMBOL_MACHU = 74,                     /* MACHU  */
  YYSYMBOL_MOV = 75,                       /* MOV  */
  YYSYMBOL_MOV1 = 76,                      /* MOV1  */
  YYSYMBOL_MOVS = 77,                      /* MOVS  */
  YYSYMBOL_MOVW = 78,                      /* MOVW  */
  YYSYMBOL_MULH = 79,                      /* MULH  */
  YYSYMBOL_MULHU = 80,                     /* MULHU  */
  YYSYMBOL_MULU = 81,                      /* MULU  */
  YYSYMBOL_NOP = 82,                       /* NOP  */
  YYSYMBOL_NOT1 = 83,                      /* NOT1  */
  YYSYMBOL_ONEB = 84,                      /* ONEB  */
  YYSYMBOL_ONEW = 85,                      /* ONEW  */
  YYSYMBOL_OR = 86,                        /* OR  */
  YYSYMBOL_OR1 = 87,                       /* OR1  */
  YYSYMBOL_POP = 88,                       /* POP  */
  YYSYMBOL_PUSH = 89,                      /* PUSH  */
  YYSYMBOL_RET = 90,                       /* RET  */
  YYSYMBOL_RETI = 91,                      /* RETI  */
  YYSYMBOL_RETB = 92,                      /* RETB  */
  YYSYMBOL_ROL = 93,                       /* ROL  */
  YYSYMBOL_ROLC = 94,                      /* ROLC  */
  YYSYMBOL_ROLWC = 95,                     /* ROLWC  */
  YYSYMBOL_ROR = 96,                       /* ROR  */
  YYSYMBOL_RORC = 97,                      /* RORC  */
  YYSYMBOL_SAR = 98,                       /* SAR  */
  YYSYMBOL_SARW = 99,                      /* SARW  */
  YYSYMBOL_SEL = 100,                      /* SEL  */
  YYSYMBOL_SET1 = 101,                     /* SET1  */
  YYSYMBOL_SHL = 102,                      /* SHL  */
  YYSYMBOL_SHLW = 103,                     /* SHLW  */
  YYSYMBOL_SHR = 104,                      /* SHR  */
  YYSYMBOL_SHRW = 105,                     /* SHRW  */
  YYSYMBOL_SKC = 106,                      /* SKC  */
  YYSYMBOL_SKH = 107,                      /* SKH  */
  YYSYMBOL_SKNC = 108,                     /* SKNC  */
  YYSYMBOL_SKNH = 109,                     /* SKNH  */
  YYSYMBOL_SKNZ = 110,                     /* SKNZ  */
  YYSYMBOL_SKZ = 111,                      /* SKZ  */
  YYSYMBOL_STOP = 112,                     /* STOP  */
  YYSYMBOL_SUB = 113,                      /* SUB  */
  YYSYMBOL_SUBC = 114,                     /* SUBC  */
  YYSYMBOL_SUBW = 115,                     /* SUBW  */
  YYSYMBOL_XCH = 116,                      /* XCH  */
  YYSYMBOL_XCHW = 117,                     /* XCHW  */
  YYSYMBOL_XOR = 118,                      /* XOR  */
  YYSYMBOL_XOR1 = 119,                     /* XOR1  */
  YYSYMBOL_120_ = 120,                     /* ','  */
  YYSYMBOL_121_ = 121,                     /* '#'  */
  YYSYMBOL_122_ = 122,                     /* '!'  */
  YYSYMBOL_123_ = 123,                     /* '['  */
  YYSYMBOL_124_ = 124,                     /* ']'  */
  YYSYMBOL_125_ = 125,                     /* '+'  */
  YYSYMBOL_126_ = 126,                     /* '.'  */
  YYSYMBOL_127_ = 127,                     /* '$'  */
  YYSYMBOL_128_ = 128,                     /* ':'  */
  YYSYMBOL_YYACCEPT = 129,                 /* $accept  */
  YYSYMBOL_statement = 130,                /* statement  */
  YYSYMBOL_131_1 = 131,                    /* $@1  */
  YYSYMBOL_132_2 = 132,                    /* $@2  */
  YYSYMBOL_133_3 = 133,                    /* $@3  */
  YYSYMBOL_134_4 = 134,                    /* $@4  */
  YYSYMBOL_135_5 = 135,                    /* $@5  */
  YYSYMBOL_136_6 = 136,                    /* $@6  */
  YYSYMBOL_137_7 = 137,                    /* $@7  */
  YYSYMBOL_138_8 = 138,                    /* $@8  */
  YYSYMBOL_139_9 = 139,                    /* $@9  */
  YYSYMBOL_140_10 = 140,                   /* $@10  */
  YYSYMBOL_141_11 = 141,                   /* $@11  */
  YYSYMBOL_142_12 = 142,                   /* $@12  */
  YYSYMBOL_143_13 = 143,                   /* $@13  */
  YYSYMBOL_144_14 = 144,                   /* $@14  */
  YYSYMBOL_145_15 = 145,                   /* $@15  */
  YYSYMBOL_146_16 = 146,                   /* $@16  */
  YYSYMBOL_147_17 = 147,                   /* $@17  */
  YYSYMBOL_148_18 = 148,                   /* $@18  */
  YYSYMBOL_149_19 = 149,                   /* $@19  */
  YYSYMBOL_150_20 = 150,                   /* $@20  */
  YYSYMBOL_151_21 = 151,                   /* $@21  */
  YYSYMBOL_152_22 = 152,                   /* $@22  */
  YYSYMBOL_153_23 = 153,                   /* $@23  */
  YYSYMBOL_154_24 = 154,                   /* $@24  */
  YYSYMBOL_155_25 = 155,                   /* $@25  */
  YYSYMBOL_156_26 = 156,                   /* $@26  */
  YYSYMBOL_157_27 = 157,                   /* $@27  */
  YYSYMBOL_158_28 = 158,                   /* $@28  */
  YYSYMBOL_159_29 = 159,                   /* $@29  */
  YYSYMBOL_160_30 = 160,                   /* $@30  */
  YYSYMBOL_161_31 = 161,                   /* $@31  */
  YYSYMBOL_162_32 = 162,                   /* $@32  */
  YYSYMBOL_163_33 = 163,                   /* $@33  */
  YYSYMBOL_164_34 = 164,                   /* $@34  */
  YYSYMBOL_165_35 = 165,                   /* $@35  */
  YYSYMBOL_166_36 = 166,                   /* $@36  */
  YYSYMBOL_167_37 = 167,                   /* $@37  */
  YYSYMBOL_168_38 = 168,                   /* $@38  */
  YYSYMBOL_opt_es = 169,                   /* opt_es  */
  YYSYMBOL_regb = 170,                     /* regb  */
  YYSYMBOL_regb_na = 171,                  /* regb_na  */
  YYSYMBOL_regw = 172,                     /* regw  */
  YYSYMBOL_regw_na = 173,                  /* regw_na  */
  YYSYMBOL_sfr = 174,                      /* sfr  */
  YYSYMBOL_addsub = 175,                   /* addsub  */
  YYSYMBOL_addsubw = 176,                  /* addsubw  */
  YYSYMBOL_andor1 = 177,                   /* andor1  */
  YYSYMBOL_bt_bf = 178,                    /* bt_bf  */
  YYSYMBOL_setclr1 = 179,                  /* setclr1  */
  YYSYMBOL_oneclrb = 180,                  /* oneclrb  */
  YYSYMBOL_oneclrw = 181,                  /* oneclrw  */
  YYSYMBOL_incdec = 182,                   /* incdec  */
  YYSYMBOL_incdecw = 183,                  /* incdecw  */
  YYSYMBOL_mov1 = 184                      /* mov1  */
};
