ravynsoft/ravynos/gnu/usr.bin/binutils/gas/config/rl78-parse.c
  case 4: /* $@1: %empty  */
#line 211 "./config/rl78-parse.y"
                      {SA((yyvsp[0].exp))}
#line 2184 "config/rl78-parse.c"
    break;

  case 5: /* statement: addsub EXPR $@1 ',' '#' EXPR  */
#line 212 "./config/rl78-parse.y"
          { B1 (0x0a|(yyvsp[-5].regno)); SET_SA ((yyvsp[-4].exp)); O1 ((yyvsp[-4].exp)); O1 ((yyvsp[0].exp)); }
#line 2190 "config/rl78-parse.c"
    break;

  case 6: /* statement: addsub A ',' A  */
#line 215 "./config/rl78-parse.y"
          { B2 (0x61, 0x01|(yyvsp[-3].regno)); }
#line 2196 "config/rl78-parse.c"
    break;

  case 7: /* statement: addsub A ',' regb_na  */
#line 218 "./config/rl78-parse.y"
          { B2 (0x61, 0x08|(yyvsp[-3].regno)); F ((yyvsp[0].regno), 13, 3); }
#line 2202 "config/rl78-parse.c"
    break;

  case 8: /* statement: addsub regb_na ',' A  */
#line 221 "./config/rl78-parse.y"
          { B2 (0x61, 0x00|(yyvsp[-3].regno)); F ((yyvsp[-2].regno), 13, 3); }
#line 2208 "config/rl78-parse.c"
    break;

  case 9: /* $@2: %empty  */
#line 223 "./config/rl78-parse.y"
                            {SA((yyvsp[0].exp))}
#line 2214 "config/rl78-parse.c"
    break;

  case 10: /* statement: addsub A ',' EXPR $@2  */
#line 224 "./config/rl78-parse.y"
          { B1 (0x0b|(yyvsp[-4].regno)); SET_SA ((yyvsp[-1].exp)); O1 ((yyvsp[-1].exp)); }
#line 2220 "config/rl78-parse.c"
    break;

  case 11: /* statement: addsub A ',' opt_es '!' EXPR  */
#line 227 "./config/rl78-parse.y"
          { B1 (0x0f|(yyvsp[-5].regno)); O2 ((yyvsp[0].exp)); rl78_linkrelax_addr16 (); }
#line 2226 "config/rl78-parse.c"
    break;

  case 12: /* statement: addsub A ',' opt_es '[' HL ']'  */
#line 230 "./config/rl78-parse.y"
          { B1 (0x0d|(yyvsp[-6].regno)); }
#line 2232 "config/rl78-parse.c"
    break;

  case 13: /* statement: addsub A ',' opt_es '[' HL '+' EXPR ']'  */
#line 233 "./config/rl78-parse.y"
          { B1 (0x0e|(yyvsp[-8].regno)); O1 ((yyvsp[-1].exp)); }
#line 2238 "config/rl78-parse.c"
    break;

  case 14: /* statement: addsub A ',' opt_es '[' HL '+' B ']'  */
#line 236 "./config/rl78-parse.y"
          { B2 (0x61, 0x80|(yyvsp[-8].regno)); }
#line 2244 "config/rl78-parse.c"
    break;

  case 15: /* statement: addsub A ',' opt_es '[' HL '+' C ']'  */
#line 239 "./config/rl78-parse.y"
          { B2 (0x61, 0x82|(yyvsp[-8].regno)); }
#line 2250 "config/rl78-parse.c"
    break;

  case 16: /* statement: addsub opt_es '!' EXPR ',' '#' EXPR  */
#line 242 "./config/rl78-parse.y"
          { if ((yyvsp[-6].regno) != 0x40)
	      { rl78_error ("Only CMP takes these operands"); }
	    else
	      { B1 (0x00|(yyvsp[-6].regno)); O2 ((yyvsp[-3].exp)); O1 ((yyvsp[0].exp)); rl78_linkrelax_addr16 (); }
	  }
#line 2260 "config/rl78-parse.c"
    break;

  case 17: /* statement: addsubw AX ',' '#' EXPR  */
#line 251 "./config/rl78-parse.y"
          { B1 (0x04|(yyvsp[-4].regno)); O2 ((yyvsp[0].exp)); }
#line 2266 "config/rl78-parse.c"
    break;

  case 18: /* statement: addsubw AX ',' regw  */
#line 254 "./config/rl78-parse.y"
          { B1 (0x01|(yyvsp[-3].regno)); F ((yyvsp[0].regno), 5, 2); }
#line 2272 "config/rl78-parse.c"
    break;

  case 19: /* $@3: %empty  */
#line 256 "./config/rl78-parse.y"
                              {SA((yyvsp[0].exp))}
#line 2278 "config/rl78-parse.c"
    break;

  case 20: /* statement: addsubw AX ',' EXPR $@3  */
#line 257 "./config/rl78-parse.y"
          { B1 (0x06|(yyvsp[-4].regno)); SET_SA ((yyvsp[-1].exp)); O1 ((yyvsp[-1].exp)); }
#line 2284 "config/rl78-parse.c"
    break;

  case 21: /* statement: addsubw AX ',' opt_es '!' EXPR  */
#line 260 "./config/rl78-parse.y"
          { B1 (0x02|(yyvsp[-5].regno)); O2 ((yyvsp[0].exp)); rl78_linkrelax_addr16 (); }
#line 2290 "config/rl78-parse.c"
    break;

  case 22: /* statement: addsubw AX ',' opt_es '[' HL '+' EXPR ']'  */
#line 263 "./config/rl78-parse.y"
          { B2 (0x61, 0x09|(yyvsp[-8].regno)); O1 ((yyvsp[-1].exp)); }
#line 2296 "config/rl78-parse.c"
    break;

  case 23: /* statement: addsubw AX ',' opt_es '[' HL ']'  */
#line 266 "./config/rl78-parse.y"
          { B3 (0x61, 0x09|(yyvsp[-6].regno), 0); }
#line 2302 "config/rl78-parse.c"
    break;

  case 24: /* statement: addsubw SP ',' '#' EXPR  */
#line 269 "./config/rl78-parse.y"
          { B1 ((yyvsp[-4].regno) ? 0x20 : 0x10); O1 ((yyvsp[0].exp));
	    if ((yyvsp[-4].regno) == 0x40)
	      rl78_error ("CMPW SP,#imm not allowed");
	  }
#line 2311 "config/rl78-parse.c"
    break;

  case 25: /* $@4: %empty  */
#line 276 "./config/rl78-parse.y"
                                     {Bit((yyvsp[0].exp))}
#line 2317 "config/rl78-parse.c"
    break;

  case 26: /* statement: andor1 CY ',' sfr '.' EXPR $@4  */
#line 277 "./config/rl78-parse.y"
          { B3 (0x71, 0x08|(yyvsp[-6].regno), (yyvsp[-3].regno)); FE ((yyvsp[-1].exp), 9, 3); }
#line 2323 "config/rl78-parse.c"
    break;

  case 27: /* $@5: %empty  */
#line 279 "./config/rl78-parse.y"
                                      {Bit((yyvsp[0].exp))}
#line 2329 "config/rl78-parse.c"
    break;

  case 28: /* statement: andor1 CY ',' EXPR '.' EXPR $@5  */
#line 280 "./config/rl78-parse.y"
          { if (expr_is_sfr ((yyvsp[-3].exp)))
	      { B2 (0x71, 0x08|(yyvsp[-6].regno)); FE ((yyvsp[-1].exp), 9, 3); O1 ((yyvsp[-3].exp)); }
	    else if (expr_is_saddr ((yyvsp[-3].exp)))
	      { B2 (0x71, 0x00|(yyvsp[-6].regno)); FE ((yyvsp[-1].exp), 9, 3); SET_SA ((yyvsp[-3].exp)); O1 ((yyvsp[-3].exp)); }
	    else
	      NOT_SFR_OR_SADDR;
	  }
#line 2341 "config/rl78-parse.c"
    break;

  case 29: /* $@6: %empty  */
#line 288 "./config/rl78-parse.y"
                                   {Bit((yyvsp[0].exp))}
#line 2347 "config/rl78-parse.c"
    break;

  case 30: /* statement: andor1 CY ',' A '.' EXPR $@6  */
#line 289 "./config/rl78-parse.y"
          { B2 (0x71, 0x88|(yyvsp[-6].regno));  FE ((yyvsp[-1].exp), 9, 3); }
#line 2353 "config/rl78-parse.c"
    break;

  case 31: /* $@7: %empty  */
#line 291 "./config/rl78-parse.y"
                                                   {Bit((yyvsp[0].exp))}
#line 2359 "config/rl78-parse.c"
    break;

  case 32: /* statement: andor1 CY ',' opt_es '[' HL ']' '.' EXPR $@7  */
#line 292 "./config/rl78-parse.y"
          { B2 (0x71, 0x80|(yyvsp[-9].regno));  FE ((yyvsp[-1].exp), 9, 3); }
#line 2365 "config/rl78-parse.c"
    break;

