ravynsoft/ravynos/gnu/usr.bin/binutils/gas/config/rl78-parse.c
  case 33: /* statement: BC '$' EXPR  */
#line 297 "./config/rl78-parse.y"
          { B1 (0xdc); PC1 ((yyvsp[0].exp)); rl78_linkrelax_branch (); }
#line 2371 "config/rl78-parse.c"
    break;

  case 34: /* statement: BNC '$' EXPR  */
#line 300 "./config/rl78-parse.y"
          { B1 (0xde); PC1 ((yyvsp[0].exp)); rl78_linkrelax_branch (); }
#line 2377 "config/rl78-parse.c"
    break;

  case 35: /* statement: BZ '$' EXPR  */
#line 303 "./config/rl78-parse.y"
          { B1 (0xdd); PC1 ((yyvsp[0].exp)); rl78_linkrelax_branch (); }
#line 2383 "config/rl78-parse.c"
    break;

  case 36: /* statement: BNZ '$' EXPR  */
#line 306 "./config/rl78-parse.y"
          { B1 (0xdf); PC1 ((yyvsp[0].exp)); rl78_linkrelax_branch (); }
#line 2389 "config/rl78-parse.c"
    break;

  case 37: /* statement: BH '$' EXPR  */
#line 309 "./config/rl78-parse.y"
          { B2 (0x61, 0xc3); PC1 ((yyvsp[0].exp)); rl78_linkrelax_branch (); }
#line 2395 "config/rl78-parse.c"
    break;

  case 38: /* statement: BNH '$' EXPR  */
#line 312 "./config/rl78-parse.y"
          { B2 (0x61, 0xd3); PC1 ((yyvsp[0].exp)); rl78_linkrelax_branch (); }
#line 2401 "config/rl78-parse.c"
    break;

  case 39: /* statement: bt_bf sfr '.' EXPR ',' '$' EXPR  */
#line 317 "./config/rl78-parse.y"
          { B3 (0x31, 0x80|(yyvsp[-6].regno), (yyvsp[-5].regno)); FE ((yyvsp[-3].exp), 9, 3); PC1 ((yyvsp[0].exp)); }
#line 2407 "config/rl78-parse.c"
    break;

  case 40: /* statement: bt_bf EXPR '.' EXPR ',' '$' EXPR  */
#line 320 "./config/rl78-parse.y"
          { if (expr_is_sfr ((yyvsp[-5].exp)))
	      { B2 (0x31, 0x80|(yyvsp[-6].regno)); FE ((yyvsp[-3].exp), 9, 3); O1 ((yyvsp[-5].exp)); PC1 ((yyvsp[0].exp)); }
	    else if (expr_is_saddr ((yyvsp[-5].exp)))
	      { B2 (0x31, 0x00|(yyvsp[-6].regno)); FE ((yyvsp[-3].exp), 9, 3); SET_SA ((yyvsp[-5].exp)); O1 ((yyvsp[-5].exp)); PC1 ((yyvsp[0].exp)); }
	    else
	      NOT_SFR_OR_SADDR;
	  }
#line 2419 "config/rl78-parse.c"
    break;

  case 41: /* statement: bt_bf A '.' EXPR ',' '$' EXPR  */
#line 329 "./config/rl78-parse.y"
          { B2 (0x31, 0x01|(yyvsp[-6].regno)); FE ((yyvsp[-3].exp), 9, 3); PC1 ((yyvsp[0].exp)); }
#line 2425 "config/rl78-parse.c"
    break;

  case 42: /* statement: bt_bf opt_es '[' HL ']' '.' EXPR ',' '$' EXPR  */
#line 332 "./config/rl78-parse.y"
          { B2 (0x31, 0x81|(yyvsp[-9].regno)); FE ((yyvsp[-3].exp), 9, 3); PC1 ((yyvsp[0].exp)); }
#line 2431 "config/rl78-parse.c"
    break;

  case 43: /* statement: BR AX  */
#line 337 "./config/rl78-parse.y"
          { B2 (0x61, 0xcb); }
#line 2437 "config/rl78-parse.c"
    break;

  case 44: /* statement: BR '$' EXPR  */
#line 340 "./config/rl78-parse.y"
          { B1 (0xef); PC1 ((yyvsp[0].exp)); rl78_linkrelax_branch (); }
#line 2443 "config/rl78-parse.c"
    break;

  case 45: /* statement: BR '$' '!' EXPR  */
#line 343 "./config/rl78-parse.y"
          { B1 (0xee); PC2 ((yyvsp[0].exp)); rl78_linkrelax_branch (); }
#line 2449 "config/rl78-parse.c"
    break;

  case 46: /* statement: BR '!' EXPR  */
#line 346 "./config/rl78-parse.y"
          { B1 (0xed); O2 ((yyvsp[0].exp)); rl78_linkrelax_branch (); }
#line 2455 "config/rl78-parse.c"
    break;

  case 47: /* statement: BR '!' '!' EXPR  */
#line 349 "./config/rl78-parse.y"
          { B1 (0xec); O3 ((yyvsp[0].exp)); rl78_linkrelax_branch (); }
#line 2461 "config/rl78-parse.c"
    break;

  case 48: /* statement: BRK  */
#line 354 "./config/rl78-parse.y"
          { B2 (0x61, 0xcc); }
#line 2467 "config/rl78-parse.c"
    break;

  case 49: /* statement: BRK1  */
#line 357 "./config/rl78-parse.y"
          { B1 (0xff); }
#line 2473 "config/rl78-parse.c"
    break;

  case 50: /* statement: CALL regw  */
#line 362 "./config/rl78-parse.y"
          { B2 (0x61, 0xca); F ((yyvsp[0].regno), 10, 2); }
#line 2479 "config/rl78-parse.c"
    break;

  case 51: /* statement: CALL '$' '!' EXPR  */
#line 365 "./config/rl78-parse.y"
          { B1 (0xfe); PC2 ((yyvsp[0].exp)); }
#line 2485 "config/rl78-parse.c"
    break;

  case 52: /* statement: CALL '!' EXPR  */
#line 368 "./config/rl78-parse.y"
          { B1 (0xfd); O2 ((yyvsp[0].exp)); }
#line 2491 "config/rl78-parse.c"
    break;

  case 53: /* statement: CALL '!' '!' EXPR  */
#line 371 "./config/rl78-parse.y"
          { B1 (0xfc); O3 ((yyvsp[0].exp)); rl78_linkrelax_branch (); }
#line 2497 "config/rl78-parse.c"
    break;

  case 54: /* statement: CALLT '[' EXPR ']'  */
#line 374 "./config/rl78-parse.y"
          { if ((yyvsp[-1].exp).X_op != O_constant)
	      rl78_error ("CALLT requires a numeric address");
	    else
	      {
	        int i = (yyvsp[-1].exp).X_add_number;
		if (i < 0x80 || i > 0xbe)
		  rl78_error ("CALLT address not 0x80..0xbe");
		else if (i & 1)
		  rl78_error ("CALLT address not even");
		else
		  {
		    B2 (0x61, 0x84);
	    	    F ((i >> 1) & 7, 9, 3);
	    	    F ((i >> 4) & 7, 14, 2);
		  }
	      }
	  }
#line 2519 "config/rl78-parse.c"
    break;

  case 55: /* statement: setclr1 CY  */
#line 395 "./config/rl78-parse.y"
          { B2 (0x71, (yyvsp[-1].regno) ? 0x88 : 0x80); }
#line 2525 "config/rl78-parse.c"
    break;

  case 56: /* statement: setclr1 sfr '.' EXPR  */
#line 398 "./config/rl78-parse.y"
          { B3 (0x71, 0x0a|(yyvsp[-3].regno), (yyvsp[-2].regno)); FE ((yyvsp[0].exp), 9, 3); }
#line 2531 "config/rl78-parse.c"
    break;

  case 57: /* statement: setclr1 EXPR '.' EXPR  */
#line 401 "./config/rl78-parse.y"
          { if (expr_is_sfr ((yyvsp[-2].exp)))
	      { B2 (0x71, 0x0a|(yyvsp[-3].regno)); FE ((yyvsp[0].exp), 9, 3); O1 ((yyvsp[-2].exp)); }
	    else if (expr_is_saddr ((yyvsp[-2].exp)))
	      { B2 (0x71, 0x02|(yyvsp[-3].regno)); FE ((yyvsp[0].exp), 9, 3); SET_SA ((yyvsp[-2].exp)); O1 ((yyvsp[-2].exp)); }
	    else
	      NOT_SFR_OR_SADDR;
	  }
#line 2543 "config/rl78-parse.c"
    break;

  case 58: /* statement: setclr1 A '.' EXPR  */
#line 410 "./config/rl78-parse.y"
          { B2 (0x71, 0x8a|(yyvsp[-3].regno));  FE ((yyvsp[0].exp), 9, 3); }
#line 2549 "config/rl78-parse.c"
    break;

  case 59: /* statement: setclr1 opt_es '!' EXPR '.' EXPR  */
#line 413 "./config/rl78-parse.y"
          { B2 (0x71, 0x00+(yyvsp[-5].regno)*0x08); FE ((yyvsp[0].exp), 9, 3); O2 ((yyvsp[-2].exp)); rl78_linkrelax_addr16 (); }
#line 2555 "config/rl78-parse.c"
    break;

  case 60: /* statement: setclr1 opt_es '[' HL ']' '.' EXPR  */
#line 416 "./config/rl78-parse.y"
          { B2 (0x71, 0x82|(yyvsp[-6].regno)); FE ((yyvsp[0].exp), 9, 3); }
#line 2561 "config/rl78-parse.c"
    break;

  case 61: /* statement: oneclrb A  */
#line 421 "./config/rl78-parse.y"
          { B1 (0xe1|(yyvsp[-1].regno)); }
#line 2567 "config/rl78-parse.c"
    break;

  case 62: /* statement: oneclrb X  */
#line 423 "./config/rl78-parse.y"
          { B1 (0xe0|(yyvsp[-1].regno)); }
#line 2573 "config/rl78-parse.c"
    break;

  case 63: /* statement: oneclrb B  */
#line 425 "./config/rl78-parse.y"
          { B1 (0xe3|(yyvsp[-1].regno)); }
#line 2579 "config/rl78-parse.c"
    break;

  case 64: /* statement: oneclrb C  */
#line 427 "./config/rl78-parse.y"
          { B1 (0xe2|(yyvsp[-1].regno)); }
#line 2585 "config/rl78-parse.c"
    break;

