ravynsoft/ravynos/gnu/usr.bin/binutils/gas/config/rl78-parse.c
  case 65: /* $@8: %empty  */
#line 429 "./config/rl78-parse.y"
                       {SA((yyvsp[0].exp))}
#line 2591 "config/rl78-parse.c"
    break;

  case 66: /* statement: oneclrb EXPR $@8  */
#line 430 "./config/rl78-parse.y"
          { B1 (0xe4|(yyvsp[-2].regno)); SET_SA ((yyvsp[-1].exp)); O1 ((yyvsp[-1].exp)); }
#line 2597 "config/rl78-parse.c"
    break;

  case 67: /* statement: oneclrb opt_es '!' EXPR  */
#line 433 "./config/rl78-parse.y"
          { B1 (0xe5|(yyvsp[-3].regno)); O2 ((yyvsp[0].exp)); rl78_linkrelax_addr16 (); }
#line 2603 "config/rl78-parse.c"
    break;

  case 68: /* statement: oneclrw AX  */
#line 438 "./config/rl78-parse.y"
          { B1 (0xe6|(yyvsp[-1].regno)); }
#line 2609 "config/rl78-parse.c"
    break;

  case 69: /* statement: oneclrw BC  */
#line 440 "./config/rl78-parse.y"
          { B1 (0xe7|(yyvsp[-1].regno)); }
#line 2615 "config/rl78-parse.c"
    break;

  case 70: /* statement: CMP0 A  */
#line 445 "./config/rl78-parse.y"
          { B1 (0xd1); }
#line 2621 "config/rl78-parse.c"
    break;

  case 71: /* statement: CMP0 X  */
#line 448 "./config/rl78-parse.y"
          { B1 (0xd0); }
#line 2627 "config/rl78-parse.c"
    break;

  case 72: /* statement: CMP0 B  */
#line 451 "./config/rl78-parse.y"
          { B1 (0xd3); }
#line 2633 "config/rl78-parse.c"
    break;

  case 73: /* statement: CMP0 C  */
#line 454 "./config/rl78-parse.y"
          { B1 (0xd2); }
#line 2639 "config/rl78-parse.c"
    break;

  case 74: /* $@9: %empty  */
#line 456 "./config/rl78-parse.y"
                    {SA((yyvsp[0].exp))}
#line 2645 "config/rl78-parse.c"
    break;

  case 75: /* statement: CMP0 EXPR $@9  */
#line 457 "./config/rl78-parse.y"
          { B1 (0xd4); SET_SA ((yyvsp[-1].exp)); O1 ((yyvsp[-1].exp)); }
#line 2651 "config/rl78-parse.c"
    break;

  case 76: /* statement: CMP0 opt_es '!' EXPR  */
#line 460 "./config/rl78-parse.y"
          { B1 (0xd5); O2 ((yyvsp[0].exp)); rl78_linkrelax_addr16 (); }
#line 2657 "config/rl78-parse.c"
    break;

  case 77: /* statement: CMPS X ',' opt_es '[' HL '+' EXPR ']'  */
#line 465 "./config/rl78-parse.y"
          { B2 (0x61, 0xde); O1 ((yyvsp[-1].exp)); }
#line 2663 "config/rl78-parse.c"
    break;

  case 78: /* statement: incdec regb  */
#line 470 "./config/rl78-parse.y"
          { B1 (0x80|(yyvsp[-1].regno)); F ((yyvsp[0].regno), 5, 3); }
#line 2669 "config/rl78-parse.c"
    break;

  case 79: /* $@10: %empty  */
#line 472 "./config/rl78-parse.y"
                      {SA((yyvsp[0].exp))}
#line 2675 "config/rl78-parse.c"
    break;

  case 80: /* statement: incdec EXPR $@10  */
#line 473 "./config/rl78-parse.y"
          { B1 (0xa4|(yyvsp[-2].regno)); SET_SA ((yyvsp[-1].exp)); O1 ((yyvsp[-1].exp)); }
#line 2681 "config/rl78-parse.c"
    break;

  case 81: /* statement: incdec '!' EXPR  */
#line 475 "./config/rl78-parse.y"
          { B1 (0xa0|(yyvsp[-2].regno)); O2 ((yyvsp[0].exp)); rl78_linkrelax_addr16 (); }
#line 2687 "config/rl78-parse.c"
    break;

  case 82: /* statement: incdec ES ':' '!' EXPR  */
#line 477 "./config/rl78-parse.y"
          { B2 (0x11, 0xa0|(yyvsp[-4].regno)); O2 ((yyvsp[0].exp)); }
#line 2693 "config/rl78-parse.c"
    break;

  case 83: /* statement: incdec '[' HL '+' EXPR ']'  */
#line 479 "./config/rl78-parse.y"
          { B2 (0x61, 0x59+(yyvsp[-5].regno)); O1 ((yyvsp[-1].exp)); }
#line 2699 "config/rl78-parse.c"
    break;

  case 84: /* statement: incdec ES ':' '[' HL '+' EXPR ']'  */
#line 481 "./config/rl78-parse.y"
          { B3 (0x11, 0x61, 0x59+(yyvsp[-7].regno)); O1 ((yyvsp[-1].exp)); }
#line 2705 "config/rl78-parse.c"
    break;

  case 85: /* statement: incdecw regw  */
#line 486 "./config/rl78-parse.y"
          { B1 (0xa1|(yyvsp[-1].regno)); F ((yyvsp[0].regno), 5, 2); }
#line 2711 "config/rl78-parse.c"
    break;

  case 86: /* $@11: %empty  */
#line 488 "./config/rl78-parse.y"
                       {SA((yyvsp[0].exp))}
#line 2717 "config/rl78-parse.c"
    break;

  case 87: /* statement: incdecw EXPR $@11  */
#line 489 "./config/rl78-parse.y"
          { B1 (0xa6|(yyvsp[-2].regno)); SET_SA ((yyvsp[-1].exp)); O1 ((yyvsp[-1].exp)); }
#line 2723 "config/rl78-parse.c"
    break;

  case 88: /* statement: incdecw opt_es '!' EXPR  */
#line 492 "./config/rl78-parse.y"
          { B1 (0xa2|(yyvsp[-3].regno)); O2 ((yyvsp[0].exp)); rl78_linkrelax_addr16 (); }
#line 2729 "config/rl78-parse.c"
    break;

  case 89: /* statement: incdecw opt_es '[' HL '+' EXPR ']'  */
#line 495 "./config/rl78-parse.y"
          { B2 (0x61, 0x79+(yyvsp[-6].regno)); O1 ((yyvsp[-1].exp)); }
#line 2735 "config/rl78-parse.c"
    break;

  case 90: /* statement: DI  */
#line 500 "./config/rl78-parse.y"
          { B3 (0x71, 0x7b, 0xfa); }
#line 2741 "config/rl78-parse.c"
    break;

  case 91: /* statement: EI  */
#line 503 "./config/rl78-parse.y"
          { B3 (0x71, 0x7a, 0xfa); }
#line 2747 "config/rl78-parse.c"
    break;

  case 92: /* $@12: %empty  */
#line 507 "./config/rl78-parse.y"
                { ISA_G14 ("MULHU"); }
#line 2753 "config/rl78-parse.c"
    break;

  case 93: /* statement: MULHU $@12  */
#line 508 "./config/rl78-parse.y"
          { B3 (0xce, 0xfb, 0x01); }
#line 2759 "config/rl78-parse.c"
    break;

  case 94: /* $@13: %empty  */
#line 510 "./config/rl78-parse.y"
               { ISA_G14 ("MULH"); }
#line 2765 "config/rl78-parse.c"
    break;

  case 95: /* statement: MULH $@13  */
#line 511 "./config/rl78-parse.y"
          { B3 (0xce, 0xfb, 0x02); }
#line 2771 "config/rl78-parse.c"
    break;

  case 96: /* statement: MULU X  */
#line 514 "./config/rl78-parse.y"
          { B1 (0xd6); }
#line 2777 "config/rl78-parse.c"
    break;

  case 97: /* $@14: %empty  */
#line 516 "./config/rl78-parse.y"
                { ISA_G14 ("DIVHU"); }
#line 2783 "config/rl78-parse.c"
    break;

  case 98: /* statement: DIVHU $@14  */
#line 517 "./config/rl78-parse.y"
          { B3 (0xce, 0xfb, 0x03); }
#line 2789 "config/rl78-parse.c"
    break;

  case 99: /* $@15: %empty  */
#line 524 "./config/rl78-parse.y"
                { ISA_G14 ("DIVWU"); }
#line 2795 "config/rl78-parse.c"
    break;

  case 100: /* statement: DIVWU $@15  */
#line 525 "./config/rl78-parse.y"
          { B3 (0xce, 0xfb, 0x0b); }
#line 2801 "config/rl78-parse.c"
    break;

  case 101: /* $@16: %empty  */
#line 527 "./config/rl78-parse.y"
                { ISA_G14 ("MACHU"); }
#line 2807 "config/rl78-parse.c"
    break;

  case 102: /* statement: MACHU $@16  */
#line 528 "./config/rl78-parse.y"
          { B3 (0xce, 0xfb, 0x05); }
#line 2813 "config/rl78-parse.c"
    break;

