ravynsoft/ravynos/gnu/usr.bin/binutils/gas/config/rl78-parse.c
  case 103: /* $@17: %empty  */
#line 530 "./config/rl78-parse.y"
               { ISA_G14 ("MACH"); }
#line 2819 "config/rl78-parse.c"
    break;

  case 104: /* statement: MACH $@17  */
#line 531 "./config/rl78-parse.y"
          { B3 (0xce, 0xfb, 0x06); }
#line 2825 "config/rl78-parse.c"
    break;

  case 105: /* statement: HALT  */
#line 536 "./config/rl78-parse.y"
          { B2 (0x61, 0xed); }
#line 2831 "config/rl78-parse.c"
    break;

  case 106: /* statement: MOV A ',' '#' EXPR  */
#line 544 "./config/rl78-parse.y"
          { B1 (0x51); O1 ((yyvsp[0].exp)); }
#line 2837 "config/rl78-parse.c"
    break;

  case 107: /* statement: MOV regb_na ',' '#' EXPR  */
#line 546 "./config/rl78-parse.y"
          { B1 (0x50); F((yyvsp[-3].regno), 5, 3); O1 ((yyvsp[0].exp)); }
#line 2843 "config/rl78-parse.c"
    break;

  case 108: /* statement: MOV sfr ',' '#' EXPR  */
#line 549 "./config/rl78-parse.y"
          { if ((yyvsp[-3].regno) != 0xfd)
	      { B2 (0xce, (yyvsp[-3].regno)); O1 ((yyvsp[0].exp)); }
	    else
	      { B1 (0x41); O1 ((yyvsp[0].exp)); }
	  }
#line 2853 "config/rl78-parse.c"
    break;

  case 109: /* $@18: %empty  */
#line 555 "./config/rl78-parse.y"
                                        {NOT_ES}
#line 2859 "config/rl78-parse.c"
    break;

  case 110: /* statement: MOV opt_es EXPR ',' '#' EXPR $@18  */
#line 556 "./config/rl78-parse.y"
          { if (expr_is_sfr ((yyvsp[-4].exp)))
	      { B1 (0xce); O1 ((yyvsp[-4].exp)); O1 ((yyvsp[-1].exp)); }
	    else if (expr_is_saddr ((yyvsp[-4].exp)))
	      { B1 (0xcd); SET_SA ((yyvsp[-4].exp)); O1 ((yyvsp[-4].exp)); O1 ((yyvsp[-1].exp)); }
	    else
	      NOT_SFR_OR_SADDR;
	  }
#line 2871 "config/rl78-parse.c"
    break;

  case 111: /* statement: MOV '!' EXPR ',' '#' EXPR  */
#line 565 "./config/rl78-parse.y"
          { B1 (0xcf); O2 ((yyvsp[-3].exp)); O1 ((yyvsp[0].exp)); rl78_linkrelax_addr16 (); }
#line 2877 "config/rl78-parse.c"
    break;

  case 112: /* statement: MOV ES ':' '!' EXPR ',' '#' EXPR  */
#line 568 "./config/rl78-parse.y"
          { B2 (0x11, 0xcf); O2 ((yyvsp[-3].exp)); O1 ((yyvsp[0].exp)); }
#line 2883 "config/rl78-parse.c"
    break;

  case 113: /* statement: MOV regb_na ',' A  */
#line 571 "./config/rl78-parse.y"
          { B1 (0x70); F ((yyvsp[-2].regno), 5, 3); }
#line 2889 "config/rl78-parse.c"
    break;

  case 114: /* statement: MOV A ',' regb_na  */
#line 574 "./config/rl78-parse.y"
          { B1 (0x60); F ((yyvsp[0].regno), 5, 3); }
#line 2895 "config/rl78-parse.c"
    break;

  case 115: /* $@19: %empty  */
#line 576 "./config/rl78-parse.y"
                                 {NOT_ES}
#line 2901 "config/rl78-parse.c"
    break;

  case 116: /* statement: MOV opt_es EXPR ',' A $@19  */
#line 577 "./config/rl78-parse.y"
          { if (expr_is_sfr ((yyvsp[-3].exp)))
	      { B1 (0x9e); O1 ((yyvsp[-3].exp)); }
	    else if (expr_is_saddr ((yyvsp[-3].exp)))
	      { B1 (0x9d); SET_SA ((yyvsp[-3].exp)); O1 ((yyvsp[-3].exp)); }
	    else
	      NOT_SFR_OR_SADDR;
	  }
#line 2913 "config/rl78-parse.c"
    break;

  case 117: /* statement: MOV A ',' opt_es '!' EXPR  */
#line 586 "./config/rl78-parse.y"
          { B1 (0x8f); O2 ((yyvsp[0].exp)); rl78_linkrelax_addr16 (); }
#line 2919 "config/rl78-parse.c"
    break;

  case 118: /* statement: MOV '!' EXPR ',' A  */
#line 589 "./config/rl78-parse.y"
          { B1 (0x9f); O2 ((yyvsp[-2].exp)); rl78_linkrelax_addr16 (); }
#line 2925 "config/rl78-parse.c"
    break;

  case 119: /* statement: MOV ES ':' '!' EXPR ',' A  */
#line 592 "./config/rl78-parse.y"
          { B2 (0x11, 0x9f); O2 ((yyvsp[-2].exp)); }
#line 2931 "config/rl78-parse.c"
    break;

  case 120: /* statement: MOV regb_na ',' opt_es '!' EXPR  */
#line 595 "./config/rl78-parse.y"
          { B1 (0xc9|reg_xbc((yyvsp[-4].regno))); O2 ((yyvsp[0].exp)); rl78_linkrelax_addr16 (); }
#line 2937 "config/rl78-parse.c"
    break;

  case 121: /* $@20: %empty  */
#line 597 "./config/rl78-parse.y"
                                 {NOT_ES}
#line 2943 "config/rl78-parse.c"
    break;

  case 122: /* statement: MOV A ',' opt_es EXPR $@20  */
#line 598 "./config/rl78-parse.y"
          { if (expr_is_saddr ((yyvsp[-1].exp)))
	      { B1 (0x8d); SET_SA ((yyvsp[-1].exp)); O1 ((yyvsp[-1].exp)); }
	    else if (expr_is_sfr ((yyvsp[-1].exp)))
	      { B1 (0x8e); O1 ((yyvsp[-1].exp)); }
	    else
	      NOT_SFR_OR_SADDR;
	  }
#line 2955 "config/rl78-parse.c"
    break;

  case 123: /* $@21: %empty  */
#line 606 "./config/rl78-parse.y"
                                      {SA((yyvsp[0].exp))}
#line 2961 "config/rl78-parse.c"
    break;

  case 124: /* $@22: %empty  */
#line 606 "./config/rl78-parse.y"
                                               {NOT_ES}
#line 2967 "config/rl78-parse.c"
    break;

  case 125: /* statement: MOV regb_na ',' opt_es EXPR $@21 $@22  */
#line 607 "./config/rl78-parse.y"
          { B1 (0xc8|reg_xbc((yyvsp[-5].regno))); SET_SA ((yyvsp[-2].exp)); O1 ((yyvsp[-2].exp)); }
#line 2973 "config/rl78-parse.c"
    break;

  case 126: /* statement: MOV A ',' sfr  */
#line 610 "./config/rl78-parse.y"
          { B2 (0x8e, (yyvsp[0].regno)); }
#line 2979 "config/rl78-parse.c"
    break;

  case 127: /* statement: MOV sfr ',' regb  */
#line 613 "./config/rl78-parse.y"
          { if ((yyvsp[0].regno) != 1)
	      rl78_error ("Only A allowed here");
	    else
	      { B2 (0x9e, (yyvsp[-2].regno)); }
	  }
#line 2989 "config/rl78-parse.c"
    break;

  case 128: /* $@23: %empty  */
#line 619 "./config/rl78-parse.y"
                                  {SA((yyvsp[0].exp))}
#line 2995 "config/rl78-parse.c"
    break;

  case 129: /* $@24: %empty  */
#line 619 "./config/rl78-parse.y"
                                           {NOT_ES}
#line 3001 "config/rl78-parse.c"
    break;

  case 130: /* statement: MOV sfr ',' opt_es EXPR $@23 $@24  */
#line 620 "./config/rl78-parse.y"
          { if ((yyvsp[-5].regno) != 0xfd)
	      rl78_error ("Only ES allowed here");
	    else
	      { B2 (0x61, 0xb8); SET_SA ((yyvsp[-2].exp)); O1 ((yyvsp[-2].exp)); }
	  }
#line 3011 "config/rl78-parse.c"
    break;

