ravynsoft/ravynos/gnu/usr.bin/binutils/gas/config/rl78-parse.c
  case 131: /* statement: MOV A ',' opt_es '[' DE ']'  */
#line 627 "./config/rl78-parse.y"
          { B1 (0x89); }
#line 3017 "config/rl78-parse.c"
    break;

  case 132: /* statement: MOV opt_es '[' DE ']' ',' A  */
#line 630 "./config/rl78-parse.y"
          { B1 (0x99); }
#line 3023 "config/rl78-parse.c"
    break;

  case 133: /* statement: MOV opt_es '[' DE '+' EXPR ']' ',' '#' EXPR  */
#line 633 "./config/rl78-parse.y"
          { B1 (0xca); O1 ((yyvsp[-4].exp)); O1 ((yyvsp[0].exp)); }
#line 3029 "config/rl78-parse.c"
    break;

  case 134: /* statement: MOV A ',' opt_es '[' DE '+' EXPR ']'  */
#line 636 "./config/rl78-parse.y"
          { B1 (0x8a); O1 ((yyvsp[-1].exp)); }
#line 3035 "config/rl78-parse.c"
    break;

  case 135: /* statement: MOV opt_es '[' DE '+' EXPR ']' ',' A  */
#line 639 "./config/rl78-parse.y"
          { B1 (0x9a); O1 ((yyvsp[-3].exp)); }
#line 3041 "config/rl78-parse.c"
    break;

  case 136: /* statement: MOV A ',' opt_es '[' HL ']'  */
#line 642 "./config/rl78-parse.y"
          { B1 (0x8b); }
#line 3047 "config/rl78-parse.c"
    break;

  case 137: /* statement: MOV opt_es '[' HL ']' ',' A  */
#line 645 "./config/rl78-parse.y"
          { B1 (0x9b); }
#line 3053 "config/rl78-parse.c"
    break;

  case 138: /* statement: MOV opt_es '[' HL '+' EXPR ']' ',' '#' EXPR  */
#line 648 "./config/rl78-parse.y"
          { B1 (0xcc); O1 ((yyvsp[-4].exp)); O1 ((yyvsp[0].exp)); }
#line 3059 "config/rl78-parse.c"
    break;

  case 139: /* statement: MOV A ',' opt_es '[' HL '+' EXPR ']'  */
#line 651 "./config/rl78-parse.y"
          { B1 (0x8c); O1 ((yyvsp[-1].exp)); }
#line 3065 "config/rl78-parse.c"
    break;

  case 140: /* statement: MOV opt_es '[' HL '+' EXPR ']' ',' A  */
#line 654 "./config/rl78-parse.y"
          { B1 (0x9c); O1 ((yyvsp[-3].exp)); }
#line 3071 "config/rl78-parse.c"
    break;

  case 141: /* statement: MOV A ',' opt_es '[' HL '+' B ']'  */
#line 657 "./config/rl78-parse.y"
          { B2 (0x61, 0xc9); }
#line 3077 "config/rl78-parse.c"
    break;

  case 142: /* statement: MOV opt_es '[' HL '+' B ']' ',' A  */
#line 660 "./config/rl78-parse.y"
          { B2 (0x61, 0xd9); }
#line 3083 "config/rl78-parse.c"
    break;

  case 143: /* statement: MOV A ',' opt_es '[' HL '+' C ']'  */
#line 663 "./config/rl78-parse.y"
          { B2 (0x61, 0xe9); }
#line 3089 "config/rl78-parse.c"
    break;

  case 144: /* statement: MOV opt_es '[' HL '+' C ']' ',' A  */
#line 666 "./config/rl78-parse.y"
          { B2 (0x61, 0xf9); }
#line 3095 "config/rl78-parse.c"
    break;

  case 145: /* statement: MOV opt_es EXPR '[' B ']' ',' '#' EXPR  */
#line 669 "./config/rl78-parse.y"
          { B1 (0x19); O2 ((yyvsp[-6].exp)); O1 ((yyvsp[0].exp)); }
#line 3101 "config/rl78-parse.c"
    break;

  case 146: /* statement: MOV A ',' opt_es EXPR '[' B ']'  */
#line 672 "./config/rl78-parse.y"
          { B1 (0x09); O2 ((yyvsp[-3].exp)); }
#line 3107 "config/rl78-parse.c"
    break;

  case 147: /* statement: MOV opt_es EXPR '[' B ']' ',' A  */
#line 675 "./config/rl78-parse.y"
          { B1 (0x18); O2 ((yyvsp[-5].exp)); }
#line 3113 "config/rl78-parse.c"
    break;

  case 148: /* statement: MOV opt_es EXPR '[' C ']' ',' '#' EXPR  */
#line 678 "./config/rl78-parse.y"
          { B1 (0x38); O2 ((yyvsp[-6].exp)); O1 ((yyvsp[0].exp)); }
#line 3119 "config/rl78-parse.c"
    break;

  case 149: /* statement: MOV A ',' opt_es EXPR '[' C ']'  */
#line 681 "./config/rl78-parse.y"
          { B1 (0x29); O2 ((yyvsp[-3].exp)); }
#line 3125 "config/rl78-parse.c"
    break;

  case 150: /* statement: MOV opt_es EXPR '[' C ']' ',' A  */
#line 684 "./config/rl78-parse.y"
          { B1 (0x28); O2 ((yyvsp[-5].exp)); }
#line 3131 "config/rl78-parse.c"
    break;

  case 151: /* statement: MOV opt_es EXPR '[' BC ']' ',' '#' EXPR  */
#line 687 "./config/rl78-parse.y"
          { B1 (0x39); O2 ((yyvsp[-6].exp)); O1 ((yyvsp[0].exp)); }
#line 3137 "config/rl78-parse.c"
    break;

  case 152: /* statement: MOV opt_es '[' BC ']' ',' '#' EXPR  */
#line 690 "./config/rl78-parse.y"
          { B3 (0x39, 0, 0); O1 ((yyvsp[0].exp)); }
#line 3143 "config/rl78-parse.c"
    break;

  case 153: /* statement: MOV A ',' opt_es EXPR '[' BC ']'  */
#line 693 "./config/rl78-parse.y"
          { B1 (0x49); O2 ((yyvsp[-3].exp)); }
#line 3149 "config/rl78-parse.c"
    break;

  case 154: /* statement: MOV A ',' opt_es '[' BC ']'  */
#line 696 "./config/rl78-parse.y"
          { B3 (0x49, 0, 0); }
#line 3155 "config/rl78-parse.c"
    break;

  case 155: /* statement: MOV opt_es EXPR '[' BC ']' ',' A  */
#line 699 "./config/rl78-parse.y"
          { B1 (0x48); O2 ((yyvsp[-5].exp)); }
#line 3161 "config/rl78-parse.c"
    break;

  case 156: /* statement: MOV opt_es '[' BC ']' ',' A  */
#line 702 "./config/rl78-parse.y"
          { B3 (0x48, 0, 0); }
#line 3167 "config/rl78-parse.c"
    break;

  case 157: /* $@25: %empty  */
#line 704 "./config/rl78-parse.y"
                                                       {NOT_ES}
#line 3173 "config/rl78-parse.c"
    break;

  case 158: /* statement: MOV opt_es '[' SP '+' EXPR ']' ',' '#' EXPR $@25  */
#line 705 "./config/rl78-parse.y"
          { B1 (0xc8); O1 ((yyvsp[-5].exp)); O1 ((yyvsp[-1].exp)); }
#line 3179 "config/rl78-parse.c"
    break;

  case 159: /* $@26: %empty  */
#line 707 "./config/rl78-parse.y"
                                              {NOT_ES}
#line 3185 "config/rl78-parse.c"
    break;

  case 160: /* statement: MOV opt_es '[' SP ']' ',' '#' EXPR $@26  */
#line 708 "./config/rl78-parse.y"
          { B2 (0xc8, 0); O1 ((yyvsp[-1].exp)); }
#line 3191 "config/rl78-parse.c"
    break;

  case 161: /* $@27: %empty  */
#line 710 "./config/rl78-parse.y"
                                                {NOT_ES}
#line 3197 "config/rl78-parse.c"
    break;

  case 162: /* statement: MOV A ',' opt_es '[' SP '+' EXPR ']' $@27  */
#line 711 "./config/rl78-parse.y"
          { B1 (0x88); O1 ((yyvsp[-2].exp)); }
#line 3203 "config/rl78-parse.c"
    break;

