ravynsoft/ravynos/gnu/usr.bin/binutils/gas/config/rl78-parse.c
  case 163: /* $@28: %empty  */
#line 713 "./config/rl78-parse.y"
                                       {NOT_ES}
#line 3209 "config/rl78-parse.c"
    break;

  case 164: /* statement: MOV A ',' opt_es '[' SP ']' $@28  */
#line 714 "./config/rl78-parse.y"
          { B2 (0x88, 0); }
#line 3215 "config/rl78-parse.c"
    break;

  case 165: /* $@29: %empty  */
#line 716 "./config/rl78-parse.y"
                                                {NOT_ES}
#line 3221 "config/rl78-parse.c"
    break;

  case 166: /* statement: MOV opt_es '[' SP '+' EXPR ']' ',' A $@29  */
#line 717 "./config/rl78-parse.y"
          { B1 (0x98); O1 ((yyvsp[-4].exp)); }
#line 3227 "config/rl78-parse.c"
    break;

  case 167: /* $@30: %empty  */
#line 719 "./config/rl78-parse.y"
                                       {NOT_ES}
#line 3233 "config/rl78-parse.c"
    break;

  case 168: /* statement: MOV opt_es '[' SP ']' ',' A $@30  */
#line 720 "./config/rl78-parse.y"
          { B2 (0x98, 0); }
#line 3239 "config/rl78-parse.c"
    break;

  case 169: /* statement: mov1 CY ',' EXPR '.' EXPR  */
#line 725 "./config/rl78-parse.y"
          { if (expr_is_saddr ((yyvsp[-2].exp)))
	      { B2 (0x71, 0x04); FE ((yyvsp[0].exp), 9, 3); SET_SA ((yyvsp[-2].exp)); O1 ((yyvsp[-2].exp)); }
	    else if (expr_is_sfr ((yyvsp[-2].exp)))
	      { B2 (0x71, 0x0c); FE ((yyvsp[0].exp), 9, 3); O1 ((yyvsp[-2].exp)); }
	    else
	      NOT_SFR_OR_SADDR;
	  }
#line 3251 "config/rl78-parse.c"
    break;

  case 170: /* statement: mov1 CY ',' A '.' EXPR  */
#line 734 "./config/rl78-parse.y"
          { B2 (0x71, 0x8c); FE ((yyvsp[0].exp), 9, 3); }
#line 3257 "config/rl78-parse.c"
    break;

  case 171: /* statement: mov1 CY ',' sfr '.' EXPR  */
#line 737 "./config/rl78-parse.y"
          { B3 (0x71, 0x0c, (yyvsp[-2].regno)); FE ((yyvsp[0].exp), 9, 3); }
#line 3263 "config/rl78-parse.c"
    break;

  case 172: /* statement: mov1 CY ',' opt_es '[' HL ']' '.' EXPR  */
#line 740 "./config/rl78-parse.y"
          { B2 (0x71, 0x84); FE ((yyvsp[0].exp), 9, 3); }
#line 3269 "config/rl78-parse.c"
    break;

  case 173: /* statement: mov1 EXPR '.' EXPR ',' CY  */
#line 743 "./config/rl78-parse.y"
          { if (expr_is_saddr ((yyvsp[-4].exp)))
	      { B2 (0x71, 0x01); FE ((yyvsp[-2].exp), 9, 3); SET_SA ((yyvsp[-4].exp)); O1 ((yyvsp[-4].exp)); }
	    else if (expr_is_sfr ((yyvsp[-4].exp)))
	      { B2 (0x71, 0x09); FE ((yyvsp[-2].exp), 9, 3); O1 ((yyvsp[-4].exp)); }
	    else
	      NOT_SFR_OR_SADDR;
	  }
#line 3281 "config/rl78-parse.c"
    break;

  case 174: /* statement: mov1 A '.' EXPR ',' CY  */
#line 752 "./config/rl78-parse.y"
          { B2 (0x71, 0x89); FE ((yyvsp[-2].exp), 9, 3); }
#line 3287 "config/rl78-parse.c"
    break;

  case 175: /* statement: mov1 sfr '.' EXPR ',' CY  */
#line 755 "./config/rl78-parse.y"
          { B3 (0x71, 0x09, (yyvsp[-4].regno)); FE ((yyvsp[-2].exp), 9, 3); }
#line 3293 "config/rl78-parse.c"
    break;

  case 176: /* statement: mov1 opt_es '[' HL ']' '.' EXPR ',' CY  */
#line 758 "./config/rl78-parse.y"
          { B2 (0x71, 0x81); FE ((yyvsp[-2].exp), 9, 3); }
#line 3299 "config/rl78-parse.c"
    break;

  case 177: /* statement: MOVS opt_es '[' HL '+' EXPR ']' ',' X  */
#line 763 "./config/rl78-parse.y"
          { B2 (0x61, 0xce); O1 ((yyvsp[-3].exp)); }
#line 3305 "config/rl78-parse.c"
    break;

  case 178: /* statement: MOVW AX ',' '#' EXPR  */
#line 768 "./config/rl78-parse.y"
          { B1 (0x30); O2 ((yyvsp[0].exp)); }
#line 3311 "config/rl78-parse.c"
    break;

  case 179: /* statement: MOVW regw_na ',' '#' EXPR  */
#line 771 "./config/rl78-parse.y"
          { B1 (0x30); F ((yyvsp[-3].regno), 5, 2); O2 ((yyvsp[0].exp)); }
#line 3317 "config/rl78-parse.c"
    break;

  case 180: /* $@31: %empty  */
#line 773 "./config/rl78-parse.y"
                                        {NOT_ES}
#line 3323 "config/rl78-parse.c"
    break;

  case 181: /* statement: MOVW opt_es EXPR ',' '#' EXPR $@31  */
#line 774 "./config/rl78-parse.y"
          { if (expr_is_saddr ((yyvsp[-4].exp)))
	      { B1 (0xc9); SET_SA ((yyvsp[-4].exp)); O1 ((yyvsp[-4].exp)); O2 ((yyvsp[-1].exp)); }
	    else if (expr_is_sfr ((yyvsp[-4].exp)))
	      { B1 (0xcb); O1 ((yyvsp[-4].exp)); O2 ((yyvsp[-1].exp)); }
	    else
	      NOT_SFR_OR_SADDR;
	  }
#line 3335 "config/rl78-parse.c"
    break;

  case 182: /* $@32: %empty  */
#line 782 "./config/rl78-parse.y"
                                  {NOT_ES}
#line 3341 "config/rl78-parse.c"
    break;

  case 183: /* statement: MOVW AX ',' opt_es EXPR $@32  */
#line 783 "./config/rl78-parse.y"
          { if (expr_is_saddr ((yyvsp[-1].exp)))
	      { B1 (0xad); SET_SA ((yyvsp[-1].exp)); O1 ((yyvsp[-1].exp)); WA((yyvsp[-1].exp)); }
	    else if (expr_is_sfr ((yyvsp[-1].exp)))
	      { B1 (0xae); O1 ((yyvsp[-1].exp)); WA((yyvsp[-1].exp)); }
	    else
	      NOT_SFR_OR_SADDR;
	  }
#line 3353 "config/rl78-parse.c"
    break;

  case 184: /* $@33: %empty  */
#line 791 "./config/rl78-parse.y"
                                  {NOT_ES}
#line 3359 "config/rl78-parse.c"
    break;

  case 185: /* statement: MOVW opt_es EXPR ',' AX $@33  */
#line 792 "./config/rl78-parse.y"
          { if (expr_is_saddr ((yyvsp[-3].exp)))
	      { B1 (0xbd); SET_SA ((yyvsp[-3].exp)); O1 ((yyvsp[-3].exp)); WA((yyvsp[-3].exp)); }
	    else if (expr_is_sfr ((yyvsp[-3].exp)))
	      { B1 (0xbe); O1 ((yyvsp[-3].exp)); WA((yyvsp[-3].exp)); }
	    else
	      NOT_SFR_OR_SADDR;
	  }
#line 3371 "config/rl78-parse.c"
    break;

  case 186: /* statement: MOVW AX ',' regw_na  */
#line 801 "./config/rl78-parse.y"
          { B1 (0x11); F ((yyvsp[0].regno), 5, 2); }
#line 3377 "config/rl78-parse.c"
    break;

  case 187: /* statement: MOVW regw_na ',' AX  */
#line 804 "./config/rl78-parse.y"
          { B1 (0x10); F ((yyvsp[-2].regno), 5, 2); }
#line 3383 "config/rl78-parse.c"
    break;

  case 188: /* statement: MOVW AX ',' opt_es '!' EXPR  */
#line 807 "./config/rl78-parse.y"
          { B1 (0xaf); O2 ((yyvsp[0].exp)); WA((yyvsp[0].exp)); rl78_linkrelax_addr16 (); }
#line 3389 "config/rl78-parse.c"
    break;

  case 189: /* statement: MOVW opt_es '!' EXPR ',' AX  */
#line 810 "./config/rl78-parse.y"
          { B1 (0xbf); O2 ((yyvsp[-2].exp)); WA((yyvsp[-2].exp)); rl78_linkrelax_addr16 (); }
#line 3395 "config/rl78-parse.c"
    break;

  case 190: /* statement: MOVW AX ',' opt_es '[' DE ']'  */
#line 813 "./config/rl78-parse.y"
          { B1 (0xa9); }
#line 3401 "config/rl78-parse.c"
    break;

  case 191: /* statement: MOVW opt_es '[' DE ']' ',' AX  */
#line 816 "./config/rl78-parse.y"
          { B1 (0xb9); }
#line 3407 "config/rl78-parse.c"
    break;

