ravynsoft/ravynos/gnu/usr.bin/binutils/gas/config/rl78-parse.c
  case 192: /* statement: MOVW AX ',' opt_es '[' DE '+' EXPR ']'  */
#line 819 "./config/rl78-parse.y"
          { B1 (0xaa); O1 ((yyvsp[-1].exp)); }
#line 3413 "config/rl78-parse.c"
    break;

  case 193: /* statement: MOVW opt_es '[' DE '+' EXPR ']' ',' AX  */
#line 822 "./config/rl78-parse.y"
          { B1 (0xba); O1 ((yyvsp[-3].exp)); }
#line 3419 "config/rl78-parse.c"
    break;

  case 194: /* statement: MOVW AX ',' opt_es '[' HL ']'  */
#line 825 "./config/rl78-parse.y"
          { B1 (0xab); }
#line 3425 "config/rl78-parse.c"
    break;

  case 195: /* statement: MOVW opt_es '[' HL ']' ',' AX  */
#line 828 "./config/rl78-parse.y"
          { B1 (0xbb); }
#line 3431 "config/rl78-parse.c"
    break;

  case 196: /* statement: MOVW AX ',' opt_es '[' HL '+' EXPR ']'  */
#line 831 "./config/rl78-parse.y"
          { B1 (0xac); O1 ((yyvsp[-1].exp)); }
#line 3437 "config/rl78-parse.c"
    break;

  case 197: /* statement: MOVW opt_es '[' HL '+' EXPR ']' ',' AX  */
#line 834 "./config/rl78-parse.y"
          { B1 (0xbc); O1 ((yyvsp[-3].exp)); }
#line 3443 "config/rl78-parse.c"
    break;

  case 198: /* statement: MOVW AX ',' opt_es EXPR '[' B ']'  */
#line 837 "./config/rl78-parse.y"
          { B1 (0x59); O2 ((yyvsp[-3].exp)); }
#line 3449 "config/rl78-parse.c"
    break;

  case 199: /* statement: MOVW opt_es EXPR '[' B ']' ',' AX  */
#line 840 "./config/rl78-parse.y"
          { B1 (0x58); O2 ((yyvsp[-5].exp)); }
#line 3455 "config/rl78-parse.c"
    break;

  case 200: /* statement: MOVW AX ',' opt_es EXPR '[' C ']'  */
#line 843 "./config/rl78-parse.y"
          { B1 (0x69); O2 ((yyvsp[-3].exp)); }
#line 3461 "config/rl78-parse.c"
    break;

  case 201: /* statement: MOVW opt_es EXPR '[' C ']' ',' AX  */
#line 846 "./config/rl78-parse.y"
          { B1 (0x68); O2 ((yyvsp[-5].exp)); }
#line 3467 "config/rl78-parse.c"
    break;

  case 202: /* statement: MOVW AX ',' opt_es EXPR '[' BC ']'  */
#line 849 "./config/rl78-parse.y"
          { B1 (0x79); O2 ((yyvsp[-3].exp)); }
#line 3473 "config/rl78-parse.c"
    break;

  case 203: /* statement: MOVW AX ',' opt_es '[' BC ']'  */
#line 852 "./config/rl78-parse.y"
          { B3 (0x79, 0, 0); }
#line 3479 "config/rl78-parse.c"
    break;

  case 204: /* statement: MOVW opt_es EXPR '[' BC ']' ',' AX  */
#line 855 "./config/rl78-parse.y"
          { B1 (0x78); O2 ((yyvsp[-5].exp)); }
#line 3485 "config/rl78-parse.c"
    break;

  case 205: /* statement: MOVW opt_es '[' BC ']' ',' AX  */
#line 858 "./config/rl78-parse.y"
          { B3 (0x78, 0, 0); }
#line 3491 "config/rl78-parse.c"
    break;

  case 206: /* $@34: %empty  */
#line 860 "./config/rl78-parse.y"
                                                 {NOT_ES}
#line 3497 "config/rl78-parse.c"
    break;

  case 207: /* statement: MOVW AX ',' opt_es '[' SP '+' EXPR ']' $@34  */
#line 861 "./config/rl78-parse.y"
          { B1 (0xa8); O1 ((yyvsp[-2].exp));  WA((yyvsp[-2].exp));}
#line 3503 "config/rl78-parse.c"
    break;

  case 208: /* $@35: %empty  */
#line 863 "./config/rl78-parse.y"
                                        {NOT_ES}
#line 3509 "config/rl78-parse.c"
    break;

  case 209: /* statement: MOVW AX ',' opt_es '[' SP ']' $@35  */
#line 864 "./config/rl78-parse.y"
          { B2 (0xa8, 0); }
#line 3515 "config/rl78-parse.c"
    break;

  case 210: /* $@36: %empty  */
#line 866 "./config/rl78-parse.y"
                                                 {NOT_ES}
#line 3521 "config/rl78-parse.c"
    break;

  case 211: /* statement: MOVW opt_es '[' SP '+' EXPR ']' ',' AX $@36  */
#line 867 "./config/rl78-parse.y"
          { B1 (0xb8); O1 ((yyvsp[-4].exp)); WA((yyvsp[-4].exp)); }
#line 3527 "config/rl78-parse.c"
    break;

  case 212: /* $@37: %empty  */
#line 869 "./config/rl78-parse.y"
                                        {NOT_ES}
#line 3533 "config/rl78-parse.c"
    break;

  case 213: /* statement: MOVW opt_es '[' SP ']' ',' AX $@37  */
#line 870 "./config/rl78-parse.y"
          { B2 (0xb8, 0); }
#line 3539 "config/rl78-parse.c"
    break;

  case 214: /* $@38: %empty  */
#line 872 "./config/rl78-parse.y"
                                {SA((yyvsp[0].exp))}
#line 3545 "config/rl78-parse.c"
    break;

  case 215: /* statement: MOVW regw_na ',' EXPR $@38  */
#line 873 "./config/rl78-parse.y"
          { B1 (0xca); F ((yyvsp[-3].regno), 2, 2); SET_SA ((yyvsp[-1].exp)); O1 ((yyvsp[-1].exp)); WA((yyvsp[-1].exp)); }
#line 3551 "config/rl78-parse.c"
    break;

  case 216: /* statement: MOVW regw_na ',' opt_es '!' EXPR  */
#line 876 "./config/rl78-parse.y"
          { B1 (0xcb); F ((yyvsp[-4].regno), 2, 2); O2 ((yyvsp[0].exp)); WA((yyvsp[0].exp)); rl78_linkrelax_addr16 (); }
#line 3557 "config/rl78-parse.c"
    break;

  case 217: /* statement: MOVW SP ',' '#' EXPR  */
#line 879 "./config/rl78-parse.y"
          { B2 (0xcb, 0xf8); O2 ((yyvsp[0].exp)); }
#line 3563 "config/rl78-parse.c"
    break;

  case 218: /* statement: MOVW SP ',' AX  */
#line 882 "./config/rl78-parse.y"
          { B2 (0xbe, 0xf8); }
#line 3569 "config/rl78-parse.c"
    break;

  case 219: /* statement: MOVW AX ',' SP  */
#line 885 "./config/rl78-parse.y"
          { B2 (0xae, 0xf8); }
#line 3575 "config/rl78-parse.c"
    break;

  case 220: /* statement: MOVW regw_na ',' SP  */
#line 888 "./config/rl78-parse.y"
          { B3 (0xcb, 0xf8, 0xff); F ((yyvsp[-2].regno), 2, 2); }
#line 3581 "config/rl78-parse.c"
    break;

  case 221: /* statement: NOP  */
#line 893 "./config/rl78-parse.y"
          { B1 (0x00); }
#line 3587 "config/rl78-parse.c"
    break;

  case 222: /* statement: NOT1 CY  */
#line 898 "./config/rl78-parse.y"
          { B2 (0x71, 0xc0); }
#line 3593 "config/rl78-parse.c"
    break;

  case 223: /* statement: POP regw  */
#line 903 "./config/rl78-parse.y"
          { B1 (0xc0); F ((yyvsp[0].regno), 5, 2); }
#line 3599 "config/rl78-parse.c"
    break;

  case 224: /* statement: POP PSW  */
#line 906 "./config/rl78-parse.y"
          { B2 (0x61, 0xcd); }
#line 3605 "config/rl78-parse.c"
    break;

