ravynsoft/ravynos/gnu/usr.bin/binutils/gas/config/rl78-parse.c
  case 225: /* statement: PUSH regw  */
#line 909 "./config/rl78-parse.y"
          { B1 (0xc1); F ((yyvsp[0].regno), 5, 2); }
#line 3611 "config/rl78-parse.c"
    break;

  case 226: /* statement: PUSH PSW  */
#line 912 "./config/rl78-parse.y"
          { B2 (0x61, 0xdd); }
#line 3617 "config/rl78-parse.c"
    break;

  case 227: /* statement: RET  */
#line 917 "./config/rl78-parse.y"
          { B1 (0xd7); }
#line 3623 "config/rl78-parse.c"
    break;

  case 228: /* statement: RETI  */
#line 920 "./config/rl78-parse.y"
          { B2 (0x61, 0xfc); }
#line 3629 "config/rl78-parse.c"
    break;

  case 229: /* statement: RETB  */
#line 923 "./config/rl78-parse.y"
          { B2 (0x61, 0xec); }
#line 3635 "config/rl78-parse.c"
    break;

  case 230: /* statement: ROL A ',' EXPR  */
#line 928 "./config/rl78-parse.y"
          { if (check_expr_is_const ((yyvsp[0].exp), 1, 1))
	      { B2 (0x61, 0xeb); }
	  }
#line 3643 "config/rl78-parse.c"
    break;

  case 231: /* statement: ROLC A ',' EXPR  */
#line 933 "./config/rl78-parse.y"
          { if (check_expr_is_const ((yyvsp[0].exp), 1, 1))
	      { B2 (0x61, 0xdc); }
	  }
#line 3651 "config/rl78-parse.c"
    break;

  case 232: /* statement: ROLWC AX ',' EXPR  */
#line 938 "./config/rl78-parse.y"
          { if (check_expr_is_const ((yyvsp[0].exp), 1, 1))
	      { B2 (0x61, 0xee); }
	  }
#line 3659 "config/rl78-parse.c"
    break;

  case 233: /* statement: ROLWC BC ',' EXPR  */
#line 943 "./config/rl78-parse.y"
          { if (check_expr_is_const ((yyvsp[0].exp), 1, 1))
	      { B2 (0x61, 0xfe); }
	  }
#line 3667 "config/rl78-parse.c"
    break;

  case 234: /* statement: ROR A ',' EXPR  */
#line 948 "./config/rl78-parse.y"
          { if (check_expr_is_const ((yyvsp[0].exp), 1, 1))
	      { B2 (0x61, 0xdb); }
	  }
#line 3675 "config/rl78-parse.c"
    break;

  case 235: /* statement: RORC A ',' EXPR  */
#line 953 "./config/rl78-parse.y"
          { if (check_expr_is_const ((yyvsp[0].exp), 1, 1))
	      { B2 (0x61, 0xfb);}
	  }
#line 3683 "config/rl78-parse.c"
    break;

  case 236: /* statement: SAR A ',' EXPR  */
#line 960 "./config/rl78-parse.y"
          { if (check_expr_is_const ((yyvsp[0].exp), 1, 7))
	      { B2 (0x31, 0x0b); FE ((yyvsp[0].exp), 9, 3); }
	  }
#line 3691 "config/rl78-parse.c"
    break;

  case 237: /* statement: SARW AX ',' EXPR  */
#line 965 "./config/rl78-parse.y"
          { if (check_expr_is_const ((yyvsp[0].exp), 1, 15))
	      { B2 (0x31, 0x0f); FE ((yyvsp[0].exp), 8, 4); }
	  }
#line 3699 "config/rl78-parse.c"
    break;

  case 238: /* statement: SEL RB0  */
#line 972 "./config/rl78-parse.y"
          { B2 (0x61, 0xcf); }
#line 3705 "config/rl78-parse.c"
    break;

  case 239: /* statement: SEL RB1  */
#line 975 "./config/rl78-parse.y"
          { B2 (0x61, 0xdf); }
#line 3711 "config/rl78-parse.c"
    break;

  case 240: /* statement: SEL RB2  */
#line 978 "./config/rl78-parse.y"
          { B2 (0x61, 0xef); }
#line 3717 "config/rl78-parse.c"
    break;

  case 241: /* statement: SEL RB3  */
#line 981 "./config/rl78-parse.y"
          { B2 (0x61, 0xff); }
#line 3723 "config/rl78-parse.c"
    break;

  case 242: /* statement: SHL A ',' EXPR  */
#line 986 "./config/rl78-parse.y"
          { if (check_expr_is_const ((yyvsp[0].exp), 1, 7))
	      { B2 (0x31, 0x09); FE ((yyvsp[0].exp), 9, 3); }
	  }
#line 3731 "config/rl78-parse.c"
    break;

  case 243: /* statement: SHL B ',' EXPR  */
#line 991 "./config/rl78-parse.y"
          { if (check_expr_is_const ((yyvsp[0].exp), 1, 7))
	      { B2 (0x31, 0x08); FE ((yyvsp[0].exp), 9, 3); }
	  }
#line 3739 "config/rl78-parse.c"
    break;

  case 244: /* statement: SHL C ',' EXPR  */
#line 996 "./config/rl78-parse.y"
          { if (check_expr_is_const ((yyvsp[0].exp), 1, 7))
	      { B2 (0x31, 0x07); FE ((yyvsp[0].exp), 9, 3); }
	  }
#line 3747 "config/rl78-parse.c"
    break;

  case 245: /* statement: SHLW AX ',' EXPR  */
#line 1001 "./config/rl78-parse.y"
          { if (check_expr_is_const ((yyvsp[0].exp), 1, 15))
	      { B2 (0x31, 0x0d); FE ((yyvsp[0].exp), 8, 4); }
	  }
#line 3755 "config/rl78-parse.c"
    break;

  case 246: /* statement: SHLW BC ',' EXPR  */
#line 1006 "./config/rl78-parse.y"
          { if (check_expr_is_const ((yyvsp[0].exp), 1, 15))
	      { B2 (0x31, 0x0c); FE ((yyvsp[0].exp), 8, 4); }
	  }
#line 3763 "config/rl78-parse.c"
    break;

  case 247: /* statement: SHR A ',' EXPR  */
#line 1013 "./config/rl78-parse.y"
          { if (check_expr_is_const ((yyvsp[0].exp), 1, 7))
	      { B2 (0x31, 0x0a); FE ((yyvsp[0].exp), 9, 3); }
	  }
#line 3771 "config/rl78-parse.c"
    break;

  case 248: /* statement: SHRW AX ',' EXPR  */
#line 1018 "./config/rl78-parse.y"
          { if (check_expr_is_const ((yyvsp[0].exp), 1, 15))
	      { B2 (0x31, 0x0e); FE ((yyvsp[0].exp), 8, 4); }
	  }
#line 3779 "config/rl78-parse.c"
    break;

  case 249: /* statement: SKC  */
#line 1025 "./config/rl78-parse.y"
          { B2 (0x61, 0xc8); rl78_relax (RL78_RELAX_BRANCH, 0); }
#line 3785 "config/rl78-parse.c"
    break;

  case 250: /* statement: SKH  */
#line 1028 "./config/rl78-parse.y"
          { B2 (0x61, 0xe3); rl78_relax (RL78_RELAX_BRANCH, 0); }
#line 3791 "config/rl78-parse.c"
    break;

  case 251: /* statement: SKNC  */
#line 1031 "./config/rl78-parse.y"
          { B2 (0x61, 0xd8); rl78_relax (RL78_RELAX_BRANCH, 0); }
#line 3797 "config/rl78-parse.c"
    break;

  case 252: /* statement: SKNH  */
#line 1034 "./config/rl78-parse.y"
          { B2 (0x61, 0xf3); rl78_relax (RL78_RELAX_BRANCH, 0); }
#line 3803 "config/rl78-parse.c"
    break;

  case 253: /* statement: SKNZ  */
#line 1037 "./config/rl78-parse.y"
          { B2 (0x61, 0xf8); rl78_relax (RL78_RELAX_BRANCH, 0); }
#line 3809 "config/rl78-parse.c"
    break;

  case 254: /* statement: SKZ  */
#line 1040 "./config/rl78-parse.y"
          { B2 (0x61, 0xe8); rl78_relax (RL78_RELAX_BRANCH, 0); }
#line 3815 "config/rl78-parse.c"
    break;

  case 255: /* statement: STOP  */
#line 1045 "./config/rl78-parse.y"
          { B2 (0x61, 0xfd); }
#line 3821 "config/rl78-parse.c"
    break;

  case 256: /* statement: XCH A ',' regb_na  */
#line 1050 "./config/rl78-parse.y"
          { if ((yyvsp[0].regno) == 0) /* X */
	      { B1 (0x08); }
	    else
	      { B2 (0x61, 0x88); F ((yyvsp[0].regno), 13, 3); }
	  }
#line 3831 "config/rl78-parse.c"
    break;

  case 257: /* statement: XCH A ',' opt_es '!' EXPR  */
#line 1057 "./config/rl78-parse.y"
          { B2 (0x61, 0xaa); O2 ((yyvsp[0].exp)); rl78_linkrelax_addr16 (); }
#line 3837 "config/rl78-parse.c"
    break;

  case 258: /* statement: XCH A ',' opt_es '[' DE ']'  */
#line 1060 "./config/rl78-parse.y"
          { B2 (0x61, 0xae); }
#line 3843 "config/rl78-parse.c"
    break;

  case 259: /* statement: XCH A ',' opt_es '[' DE '+' EXPR ']'  */
#line 1063 "./config/rl78-parse.y"
          { B2 (0x61, 0xaf); O1 ((yyvsp[-1].exp)); }
#line 3849 "config/rl78-parse.c"
    break;

  case 260: /* statement: XCH A ',' opt_es '[' HL ']'  */
#line 1066 "./config/rl78-parse.y"
          { B2 (0x61, 0xac); }
#line 3855 "config/rl78-parse.c"
    break;

