ravynsoft/ravynos/gnu/usr.bin/binutils/gas/config/rl78-parse.c
  case 261: /* statement: XCH A ',' opt_es '[' HL '+' EXPR ']'  */
#line 1069 "./config/rl78-parse.y"
          { B2 (0x61, 0xad); O1 ((yyvsp[-1].exp)); }
#line 3861 "config/rl78-parse.c"
    break;

  case 262: /* statement: XCH A ',' opt_es '[' HL '+' B ']'  */
#line 1072 "./config/rl78-parse.y"
          { B2 (0x61, 0xb9); }
#line 3867 "config/rl78-parse.c"
    break;

  case 263: /* statement: XCH A ',' opt_es '[' HL '+' C ']'  */
#line 1075 "./config/rl78-parse.y"
          { B2 (0x61, 0xa9); }
#line 3873 "config/rl78-parse.c"
    break;

  case 264: /* statement: XCH A ',' EXPR  */
#line 1078 "./config/rl78-parse.y"
          { if (expr_is_sfr ((yyvsp[0].exp)))
	      { B2 (0x61, 0xab); O1 ((yyvsp[0].exp)); }
	    else if (expr_is_saddr ((yyvsp[0].exp)))
	      { B2 (0x61, 0xa8); SET_SA ((yyvsp[0].exp)); O1 ((yyvsp[0].exp)); }
	    else
	      NOT_SFR_OR_SADDR;
	  }
#line 3885 "config/rl78-parse.c"
    break;

  case 265: /* statement: XCHW AX ',' regw_na  */
#line 1089 "./config/rl78-parse.y"
          { B1 (0x31); F ((yyvsp[0].regno), 5, 2); }
#line 3891 "config/rl78-parse.c"
    break;

  case 267: /* opt_es: ES ':'  */
#line 1099 "./config/rl78-parse.y"
          { rl78_prefix (0x11); }
#line 3897 "config/rl78-parse.c"
    break;

  case 268: /* regb: X  */
#line 1102 "./config/rl78-parse.y"
            { (yyval.regno) = 0; }
#line 3903 "config/rl78-parse.c"
    break;

  case 269: /* regb: A  */
#line 1103 "./config/rl78-parse.y"
            { (yyval.regno) = 1; }
#line 3909 "config/rl78-parse.c"
    break;

  case 270: /* regb: C  */
#line 1104 "./config/rl78-parse.y"
            { (yyval.regno) = 2; }
#line 3915 "config/rl78-parse.c"
    break;

  case 271: /* regb: B  */
#line 1105 "./config/rl78-parse.y"
            { (yyval.regno) = 3; }
#line 3921 "config/rl78-parse.c"
    break;

  case 272: /* regb: E  */
#line 1106 "./config/rl78-parse.y"
            { (yyval.regno) = 4; }
#line 3927 "config/rl78-parse.c"
    break;

  case 273: /* regb: D  */
#line 1107 "./config/rl78-parse.y"
            { (yyval.regno) = 5; }
#line 3933 "config/rl78-parse.c"
    break;

  case 274: /* regb: L  */
#line 1108 "./config/rl78-parse.y"
            { (yyval.regno) = 6; }
#line 3939 "config/rl78-parse.c"
    break;

  case 275: /* regb: H  */
#line 1109 "./config/rl78-parse.y"
            { (yyval.regno) = 7; }
#line 3945 "config/rl78-parse.c"
    break;

  case 276: /* regb_na: X  */
#line 1112 "./config/rl78-parse.y"
            { (yyval.regno) = 0; }
#line 3951 "config/rl78-parse.c"
    break;

  case 277: /* regb_na: C  */
#line 1113 "./config/rl78-parse.y"
            { (yyval.regno) = 2; }
#line 3957 "config/rl78-parse.c"
    break;

  case 278: /* regb_na: B  */
#line 1114 "./config/rl78-parse.y"
            { (yyval.regno) = 3; }
#line 3963 "config/rl78-parse.c"
    break;

  case 279: /* regb_na: E  */
#line 1115 "./config/rl78-parse.y"
            { (yyval.regno) = 4; }
#line 3969 "config/rl78-parse.c"
    break;

  case 280: /* regb_na: D  */
#line 1116 "./config/rl78-parse.y"
            { (yyval.regno) = 5; }
#line 3975 "config/rl78-parse.c"
    break;

  case 281: /* regb_na: L  */
#line 1117 "./config/rl78-parse.y"
            { (yyval.regno) = 6; }
#line 3981 "config/rl78-parse.c"
    break;

  case 282: /* regb_na: H  */
#line 1118 "./config/rl78-parse.y"
            { (yyval.regno) = 7; }
#line 3987 "config/rl78-parse.c"
    break;

  case 283: /* regw: AX  */
#line 1121 "./config/rl78-parse.y"
             { (yyval.regno) = 0; }
#line 3993 "config/rl78-parse.c"
    break;

  case 284: /* regw: BC  */
#line 1122 "./config/rl78-parse.y"
             { (yyval.regno) = 1; }
#line 3999 "config/rl78-parse.c"
    break;

  case 285: /* regw: DE  */
#line 1123 "./config/rl78-parse.y"
             { (yyval.regno) = 2; }
#line 4005 "config/rl78-parse.c"
    break;

  case 286: /* regw: HL  */
#line 1124 "./config/rl78-parse.y"
             { (yyval.regno) = 3; }
#line 4011 "config/rl78-parse.c"
    break;

  case 287: /* regw_na: BC  */
#line 1127 "./config/rl78-parse.y"
             { (yyval.regno) = 1; }
#line 4017 "config/rl78-parse.c"
    break;

  case 288: /* regw_na: DE  */
#line 1128 "./config/rl78-parse.y"
             { (yyval.regno) = 2; }
#line 4023 "config/rl78-parse.c"
    break;

  case 289: /* regw_na: HL  */
#line 1129 "./config/rl78-parse.y"
             { (yyval.regno) = 3; }
#line 4029 "config/rl78-parse.c"
    break;

  case 290: /* sfr: SPL  */
#line 1132 "./config/rl78-parse.y"
              { (yyval.regno) = 0xf8; }
#line 4035 "config/rl78-parse.c"
    break;

  case 291: /* sfr: SPH  */
#line 1133 "./config/rl78-parse.y"
              { (yyval.regno) = 0xf9; }
#line 4041 "config/rl78-parse.c"
    break;

  case 292: /* sfr: PSW  */
#line 1134 "./config/rl78-parse.y"
              { (yyval.regno) = 0xfa; }
#line 4047 "config/rl78-parse.c"
    break;

  case 293: /* sfr: CS  */
#line 1135 "./config/rl78-parse.y"
              { (yyval.regno) = 0xfc; }
#line 4053 "config/rl78-parse.c"
    break;

  case 294: /* sfr: ES  */
#line 1136 "./config/rl78-parse.y"
              { (yyval.regno) = 0xfd; }
#line 4059 "config/rl78-parse.c"
    break;

  case 295: /* sfr: PMC  */
#line 1137 "./config/rl78-parse.y"
              { (yyval.regno) = 0xfe; }
#line 4065 "config/rl78-parse.c"
    break;

  case 296: /* sfr: MEM  */
#line 1138 "./config/rl78-parse.y"
              { (yyval.regno) = 0xff; }
#line 4071 "config/rl78-parse.c"
    break;

  case 297: /* addsub: ADD  */
#line 1144 "./config/rl78-parse.y"
               { (yyval.regno) = 0x00; }
#line 4077 "config/rl78-parse.c"
    break;

  case 298: /* addsub: ADDC  */
#line 1145 "./config/rl78-parse.y"
               { (yyval.regno) = 0x10; }
#line 4083 "config/rl78-parse.c"
    break;

  case 299: /* addsub: SUB  */
#line 1146 "./config/rl78-parse.y"
               { (yyval.regno) = 0x20; }
#line 4089 "config/rl78-parse.c"
    break;

  case 300: /* addsub: SUBC  */
#line 1147 "./config/rl78-parse.y"
               { (yyval.regno) = 0x30; }
#line 4095 "config/rl78-parse.c"
    break;

  case 301: /* addsub: CMP  */
#line 1148 "./config/rl78-parse.y"
               { (yyval.regno) = 0x40; }
#line 4101 "config/rl78-parse.c"
    break;

  case 302: /* addsub: AND_  */
#line 1149 "./config/rl78-parse.y"
               { (yyval.regno) = 0x50; }
#line 4107 "config/rl78-parse.c"
    break;

  case 303: /* addsub: OR  */
#line 1150 "./config/rl78-parse.y"
               { (yyval.regno) = 0x60; }
#line 4113 "config/rl78-parse.c"
    break;

