ravynsoft/ravynos/gnu/usr.bin/binutils/gas/config/rl78-parse.c
  case 304: /* addsub: XOR  */
#line 1151 "./config/rl78-parse.y"
               { (yyval.regno) = 0x70; }
#line 4119 "config/rl78-parse.c"
    break;

  case 305: /* addsubw: ADDW  */
#line 1154 "./config/rl78-parse.y"
                { (yyval.regno) = 0x00; }
#line 4125 "config/rl78-parse.c"
    break;

  case 306: /* addsubw: SUBW  */
#line 1155 "./config/rl78-parse.y"
                { (yyval.regno) = 0x20; }
#line 4131 "config/rl78-parse.c"
    break;

  case 307: /* addsubw: CMPW  */
#line 1156 "./config/rl78-parse.y"
                { (yyval.regno) = 0x40; }
#line 4137 "config/rl78-parse.c"
    break;

  case 308: /* andor1: AND1  */
#line 1159 "./config/rl78-parse.y"
               { (yyval.regno) = 0x05; rl78_bit_insn = 1; }
#line 4143 "config/rl78-parse.c"
    break;

  case 309: /* andor1: OR1  */
#line 1160 "./config/rl78-parse.y"
               { (yyval.regno) = 0x06; rl78_bit_insn = 1; }
#line 4149 "config/rl78-parse.c"
    break;

  case 310: /* andor1: XOR1  */
#line 1161 "./config/rl78-parse.y"
               { (yyval.regno) = 0x07; rl78_bit_insn = 1; }
#line 4155 "config/rl78-parse.c"
    break;

  case 311: /* bt_bf: BT  */
#line 1164 "./config/rl78-parse.y"
             { (yyval.regno) = 0x02;    rl78_bit_insn = 1; rl78_linkrelax_branch (); }
#line 4161 "config/rl78-parse.c"
    break;

  case 312: /* bt_bf: BF  */
#line 1165 "./config/rl78-parse.y"
             { (yyval.regno) = 0x04;    rl78_bit_insn = 1; rl78_linkrelax_branch (); }
#line 4167 "config/rl78-parse.c"
    break;

  case 313: /* bt_bf: BTCLR  */
#line 1166 "./config/rl78-parse.y"
                { (yyval.regno) = 0x00; rl78_bit_insn = 1; }
#line 4173 "config/rl78-parse.c"
    break;

  case 314: /* setclr1: SET1  */
#line 1169 "./config/rl78-parse.y"
               { (yyval.regno) = 0; rl78_bit_insn = 1; }
#line 4179 "config/rl78-parse.c"
    break;

  case 315: /* setclr1: CLR1  */
#line 1170 "./config/rl78-parse.y"
               { (yyval.regno) = 1; rl78_bit_insn = 1; }
#line 4185 "config/rl78-parse.c"
    break;

  case 316: /* oneclrb: ONEB  */
#line 1173 "./config/rl78-parse.y"
               { (yyval.regno) = 0x00; }
#line 4191 "config/rl78-parse.c"
    break;

  case 317: /* oneclrb: CLRB  */
#line 1174 "./config/rl78-parse.y"
               { (yyval.regno) = 0x10; }
#line 4197 "config/rl78-parse.c"
    break;

  case 318: /* oneclrw: ONEW  */
#line 1177 "./config/rl78-parse.y"
               { (yyval.regno) = 0x00; }
#line 4203 "config/rl78-parse.c"
    break;

  case 319: /* oneclrw: CLRW  */
#line 1178 "./config/rl78-parse.y"
               { (yyval.regno) = 0x10; }
#line 4209 "config/rl78-parse.c"
    break;

  case 320: /* incdec: INC  */
#line 1181 "./config/rl78-parse.y"
              { (yyval.regno) = 0x00; }
#line 4215 "config/rl78-parse.c"
    break;

  case 321: /* incdec: DEC  */
#line 1182 "./config/rl78-parse.y"
              { (yyval.regno) = 0x10; }
#line 4221 "config/rl78-parse.c"
    break;

  case 322: /* incdecw: INCW  */
#line 1185 "./config/rl78-parse.y"
               { (yyval.regno) = 0x00; }
#line 4227 "config/rl78-parse.c"
    break;

  case 323: /* incdecw: DECW  */
#line 1186 "./config/rl78-parse.y"
               { (yyval.regno) = 0x10; }
#line 4233 "config/rl78-parse.c"
    break;

  case 324: /* mov1: MOV1  */
#line 1189 "./config/rl78-parse.y"
               { rl78_bit_insn = 1; }
#line 4239 "config/rl78-parse.c"
    break;


#line 4243 "config/rl78-parse.c"

      default: break;
    }
  /* User semantic actions sometimes alter yychar, and that requires
     that yytoken be updated with the new translation.  We take the
     approach of translating immediately before every use of yytoken.
     One alternative is translating here after every semantic action,
     but that translation would be missed if the semantic action invokes
     YYABORT, YYACCEPT, or YYERROR immediately after altering yychar or
     if it invokes YYBACKUP.  In the case of YYABORT or YYACCEPT, an
     incorrect destructor might then be invoked immediately.  In the
     case of YYERROR or YYBACKUP, subsequent parser actions might lead
     to an incorrect destructor call or verbose syntax error message
     before the lookahead is translated.  */
  YY_SYMBOL_PRINT ("-> $$ =", YY_CAST (yysymbol_kind_t, yyr1[yyn]), &yyval, &yyloc);

  YYPOPSTACK (yylen);
  yylen = 0;

  *++yyvsp = yyval;

  /* Now 'shift' the result of the reduction.  Determine what state
     that goes to, based on the state we popped back to and the rule
     number reduced by.  */
  {
    const int yylhs = yyr1[yyn] - YYNTOKENS;
    const int yyi = yypgoto[yylhs] + *yyssp;
    yystate = (0 <= yyi && yyi <= YYLAST && yycheck[yyi] == *yyssp
               ? yytable[yyi]
               : yydefgoto[yylhs]);
  }

  goto yynewstate;


/*--------------------------------------.
| yyerrlab -- here on detecting error.  |
`--------------------------------------*/
yyerrlab:
  /* Make sure we have latest lookahead translation.  See comments at
     user semantic actions for why this is necessary.  */
  yytoken = yychar == YYEMPTY ? YYSYMBOL_YYEMPTY : YYTRANSLATE (yychar);
  /* If not already recovering from an error, report this error.  */
  if (!yyerrstatus)
    {
      ++yynerrs;
      yyerror (YY_("syntax error"));
    }

  if (yyerrstatus == 3)
    {
      /* If just tried and failed to reuse lookahead token after an
         error, discard it.  */

      if (yychar <= YYEOF)
        {
          /* Return failure if at end of input.  */
          if (yychar == YYEOF)
            YYABORT;
        }
      else
        {
          yydestruct ("Error: discarding",
                      yytoken, &yylval);
          yychar = YYEMPTY;
        }
    }

  /* Else will try to reuse lookahead token after shifting the error
     token.  */
  goto yyerrlab1;


/*---------------------------------------------------.
| yyerrorlab -- error raised explicitly by YYERROR.  |
`---------------------------------------------------*/
yyerrorlab:
  /* Pacify compilers when the user code never invokes YYERROR and the
     label yyerrorlab therefore never appears in user code.  */
  if (0)
    YYERROR;
  ++yynerrs;

  /* Do not reclaim the symbols of the rule whose action triggered
     this YYERROR.  */
  YYPOPSTACK (yylen);
  yylen = 0;
  YY_STACK_PRINT (yyss, yyssp);
  yystate = *yyssp;
  goto yyerrlab1;


/*-------------------------------------------------------------.
| yyerrlab1 -- common code for both syntax error and YYERROR.  |
`-------------------------------------------------------------*/
yyerrlab1:
  yyerrstatus = 3;      /* Each real token shifted decrements this.  */

